#### TASK 02: Data Preparation

1. Reading and combining data

In [4]:
import pandas as pd
import numpy as np
import glob
import seaborn as sns
import matplotlib.pyplot as plt
from scipy.stats import zscore

In [5]:
path ='PassengerVehicle_Stats/*.csv'  
csv_files = glob.glob(path)

# Load all CSV files into a list
dataframes = [pd.read_csv(file) for file in csv_files]

# Concatenate all dataframes into a single DataFrame
vehicles_df = pd.concat(dataframes, ignore_index=True)

# Display the first few rows of the combined DataFrame
vehicles_df.head()

,Unnamed: 0,Public Vehicle Number,Status,Vehicle Make,Vehicle Model,Vehicle Model Year,Vehicle Color,Vehicle Fuel Source,Wheelchair Accessible,Company Name,Address,City,State,ZIP Code,Taxi Affiliation,Taxi Medallion License Management,Record ID
0,1286,12009,RESERVED,CHEVROLET,EXPRESS,2014.0,BLACK,Bio-Diesel,N,CHICAGO PRIVATE TOURS LLC,4567 S. OAKENWALD AVE.,CHICAGO,IL,60653.0,NaN,NaN,12009Charter Sightseeing
1,2095,12248,INACTIVE,MERCEDES,SPRINTER,2010.0,SILVER,Bio-Diesel,N,O'HARE-MIDWAY LIMOUSINE SERVICE INC # 2,4610 N. CLARK ST.,CHICAGO,IL,60640.0,NaN,NaN,12248Charter Sightseeing
2,7950,13527,INACTIVE,VAN HOOL,TD925,2008.0,RED,Bio-Diesel,N,"TRT TRANSPORTATION, INC.",4400 S. RACINE AVE.,CHICAGO,IL,60609.0,NaN,NaN,13527Charter Sightseeing
3,8700,12248,INACTIVE,MERCEDES,SPRINTER,2010.0,SILVER,Bio-Diesel,N,O'HARE-MIDWAY LIMOUSINE SERVICE INC # 2,4610 N. CLARK ST.,CHICAGO,IL,60640.0,NaN,NaN,12248Charter Sightseeing
4,9359,13528,INACTIVE,VAN HOOL,TD925,2008.0,RED,Bio-Diesel,N,"TRT TRANSPORTATION, INC.",4400 S. RACINE AVE.,CHICAGO,IL,60609.0,NaN,NaN,13528Charter Sightseeing

In [6]:
vehicles_df.to_csv('combined_vehicles.csv', index=False)

In [7]:
# No. of records and columns
vehicles_df.shape

(16602, 17)

2. Initial data exploration and cleaning

Examine dataFrame structure

In [8]:
# Displays a concise summary of the DataFrame
vehicles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16602 entries, 0 to 16601
Data columns (total 17 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Unnamed: 0                          16602 non-null  int64
 1   Public Vehicle Number               16602 non-null  int64
 2   Status                              16602 non-null  object
 3   Vehicle Make                        14685 non-null  object
 4   Vehicle Model                       14639 non-null  object
 5   Vehicle Model Year                  14660 non-null  float64
 6   Vehicle Color                       14616 non-null  object
 7   Vehicle Fuel Source                 16602 non-null  object
 8   Wheelchair Accessible               16602 non-null  object
 9   Company Name                        16602 non-null  object
 10  Address                             14816 non-null  object
 11  City                                14816 non-null  object
 12  State                               14816 non-null  object
 13  ZIP Code                            14816 non-null  float64
 14  Taxi Affiliation                    7348 non-null   object
 15  Taxi Medallion License Management   7321 non-null   object
 16  Record ID                           16602 non-null  object
dtypes: float64(2), int64(2), object(13)
memory usage: 2.2+ MB

In [9]:
# Descriptive statistics for numeric columns in the DataFrame
vehicles_df.describe()

        Unnamed: 0  Public Vehicle Number  Vehicle Model Year      ZIP Code
count  16602.00000           1.660200e+04        14660.000000  14816.000000
mean    8300.50000           3.854566e+04         2012.669714  60612.519573
std     4792.72892           1.372946e+05           83.622806    104.290880
min        0.00000           0.000000e+00            0.000000  60004.000000
25%     4150.25000           3.633250e+03         2013.000000  60619.000000
50%     8300.50000           6.991500e+03         2016.000000  60631.000000
75%    12450.75000           1.683925e+04         2021.000000  60646.000000
max    16601.00000           6.902206e+06         2025.000000  61111.000000

In [10]:
# Returns the number of unique values for each column in the DataFrame
vehicles_df.nunique()

Unnamed: 0                            16602
Public Vehicle Number                 14473
Status                                    8
Vehicle Make                             86
Vehicle Model                           292
Vehicle Model Year                       48
Vehicle Color                            88
Vehicle Fuel Source                       9
Wheelchair Accessible                     2
Company Name                           7494
Address                                2366
City                                     37
State                                     1
ZIP Code                                 92
Taxi Affiliation                         24
Taxi Medallion License Management        10
Record ID                             15667
dtype: int64

Check for Duplicates

In [12]:
vehicles_df.duplicated().sum()

np.int64(0)

In [13]:
vehicles_df[vehicles_df.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, Public Vehicle Number, Status, Vehicle Make, Vehicle Model, Vehicle Model Year, Vehicle Color, Vehicle Fuel Source, Wheelchair Accessible, Company Name, Address, City, State, ZIP Code, Taxi Affiliation, Taxi Medallion License Management , Record ID]
Index: []

Remove duplicate records

In [14]:
#If any. But no duplicates in this dataset
vehicles_df = vehicles_df.drop_duplicates()